clojure/cheatsheet.org
#+title: Clojure cheatsheet


* Tools (CLI)

- Show classpath: ~clojure -Spath~
- Find dependency versions:
~clj -X:deps find-versions :lib clojure.java-time/clojure.java-time~
- Write dependency expansion to ~trace.edn~: ~clj -Strace~
- Get full help from the docstrings for any installed tool, e.g.:
~clojure -A:deps -Tantq help/doc~
- Run build function, e.g. ~clj -T:build install~
- Create new library: ~clojure -Tclj-new lib :name myname/mylib~
- Dependency with local location:
  #+begin_src clojure
  :override-deps {techascent/tech.ml.dataset
                  {:local/root "/Users/yiffle/programming/code/cljc/clj/tech.ml.dataset"}}
  #+end_src


* Basics / Miscellanea

- Unused argument: _, e.g. ~(fn [_] do-something)~

- Anonymous functions:
  #+begin_src clojure
  (fn [msg] (println msg))
  ;; equivalent:
  #(println %)
  ;; positional args: %1, %2, etc.
  #+end_src

- Useful functions:
  - ~name~: Returns the name String of a string, symbol or keyword, e.g.

    #+begin_src clojure
    (name :a)
    (name "a")
    (name 'a)
    #+end_src

  - ~namespace~: Returns the namespace string of a symbol or keyword

- Using a main
  - With entry function ~run~:
  ~$ clj -X hello/run~
  - Or using entry function ~-main~
  - Launching a script:
    ~$ clj -M /path/to/myscript.clj arg1 arg2 arg3~, where
    ~*command-line-args*~ => ~("arg1" "arg2" "arg3")~
  - [[https://book.babashka.org/][Babashka?]]

- ~*clojure-version*~

- ~#_~ (optionally followed by a space) tells the reader to ignore the next form completely.
  - Can be stacked to omit multiple forms

- Equality: ~=~ is a value-based operation, while ~identical?~ tests whether its arguments are the same object
  - Gotcha: this seems subject to some subtleties that produce apparent inconsistencies (see below)
    #+begin_src clojure
    (identical? [1] [1])
    ;; => false
    (= [1] [1])
    ;; => true
    (= #{1} '(1))
    ;; => false
    (= #{1} [1])
    ;; => false
    (= [1] '(1))
    ;; => true
    #+end_src

- Value of last evaluated expression: ~*1~. Analogously, ~*2~ and ~*3~ (no higher).

- Shell commands:
#+begin_src clojure
(require '[clojure.java.shell :as sh])
(sh/sh "ls" "-aul")
#+end_src

** Help
- Print public vars (including functions) in a namespace: ~(dir namespace)~
- All namespaces: ~(all-ns)~
- All public definitions in all currently-loaded namespaces matching regex or stringable thing: ~(apropos str-or-pattern)~
- View source code for ~sym~: ~(source sym)~


* Syntax
- ~..~
  E.g.: ~(.. System (getProperties) (get "os.name"))~
  expands to ~(. (. System (getProperties)) (get "os.name"))~



* Strings
- ~re-quote-replacement~: escape special characters in literal replacement for a pattern match in ~replace~ or ~replace-first~
  #+begin_src clojure
  (require '[clojure.string :as s])
  (def s "May 2018, June 2019")
  (s/replace s #"May|June" "10$") ;; IllegalArgumentException
  (s/replace s #"May|June" (s/re-quote-replacement "10$ in"))
  #+end_src


* Collections

- ~find~: returns map entry for given key, or ~nil~ if absent
#+begin_src clojure
(find {:a 1} :a)
;; => [:a 1]
(val (find {:a 1} :a))
;; => 1
(type (find {:a 1} :a))
;; => clojure.lang.MapEntry
(key (find {:a 1} :a))
;; => :a
#+end_src

- ~vector~ vs. ~vec~
#+begin_src clojure
(vector '(1 2 3))
;; => [(1 2 3)]
(vec '(1 2 3))
;; => [1 2 3]
#+end_src

- ~replace~: ~(replace smap)~, ~(replace smap coll)~
Note: 1. Also applies to sequences. 2. similarities with and differences from ~map~
#+begin_src clojure
(replace [10 9 8 7 6] [0 2 4])
;; [10 8 6]
(replace {2 :two, 4 :four} [4 2 3 4 5 6 2])
;; [:four :two 3 :four 5 6 :two]
(map {2 :two, 4 :four} [4 2 3 4 5 6 2])
;; (:four :two nil :four nil nil :two)
(replace [] [0])
;; [0]
(map [] [0])
;; IndexOutOfBoundsException ...
#+end_src

- ~index~: ~(index xrel ks)~
#+begin_src clojure
(require '[clojure.set :refer [index]])
(def weights #{ {:name 'betsy :weight 1000}
                {:name 'jake :weight 756}
                {:name 'shyq :weight 1000} })
(index weights [:weight])
;; {{:weight 756}  #{{:name jake, :weight 756}},
;; {:weight 1000} #{{:name shyq, :weight 1000}
;;                  {:name betsy, :weight 1000}}}
#+end_src

- ArrayMap a.k.a. array-map, e.g. ~(array-map :a 10)~
  - Maintains key order. Linear lookup performance, "only suitable for /very small/ maps".
  - Only maintains order when un-"modified". Subsequent assoc-ing "eventually" causes it to "become" a hash-map.

- ~into~: ~(into)~, ~(into to)~, ~(into to from)~, ~(into to xform from)~
Conjoin all items of ~from~ into ~to~, e.g.
#+begin_src clojure
(into (sorted-map) [{:a 1} {:c 3} {:b 2}])
;; => {:a 1, :b 2, :c 3}
(into [] {1 2, 3 4})
;; => [[1 2] [3 4]]
(into '() [1 2 3])
;; => (3 2 1)
#+end_src

- ~reduced~: ~(reduced x)~ wraps x such that a ~reduce~ terminates with the value x

- ~subvec~: ~(subvec v start)~ ~(subvec v start end)~
#+begin_src clojure
(subvec [1 2 3 4 5 6 7] 2)
;; => [3 4 5 6 7]
(subvec [1 2 3 4 5 6 7] 2 4)
;; => [3 4]
#+end_src

- ~zipmap~: ~(zipmap keys vals)~
#+begin_src clojure
(zipmap [:a :b :c :d :e] [1 2 3 4 5])
;; {:a 1, :b 2, :c 3, :d 4, :e 5}
(zipmap [:a :b :c] [1 2])
;; {:a 1, :b 2}
(zipmap [:a :b :c] (repeat nil))
;; {:a nil, :b nil, :c nil}
#+end_src

** Sequences

- ~repeat~: ~(repeat x)~, ~(repeat n x)~. Note: result is lazy.
#+begin_src clojure
(take 5 (repeat "x"))
;; => ("x" "x" "x" "x" "x")
(repeat 5 "x")
;; => ("x" "x" "x" "x" "x")
#+end_src

- ~list*~
#+begin_src clojure
(list* 1 2 [3 4])
;; => (1 2 3)
;; Corner cases:
(list* nil [1 2])
;; => (nil 1 2)
(list* 1 nil)
;; => (1)
(list* () [1 2])
;; => (() 1 2)
(list* 1 ())
;; => (1)
#+end_src

- ~map-indexed~

** Sets
~select~: ~(select pred xset)~

** TODO walk, pre-walk, post-walk


* Transients
- Vectors, hash-maps, and hash-sets supported
- ~(transient ds)~: O(1) creation from persistent data structures
- Shares structure with persistent source
- Interim return values must be returned
- ~(persistent! ds)~: O(1) creation of persistent data structure when done building results
  - Transient must not be used after: all operations will throw exceptions.
- Same code structure as functional version: ~conj!~, ~pop!~, ~assoc!~, ~dissoc!~, ~disj!~


* Functions beget functions

- ~apply~
  #+begin_src clojure
  (def strs ["a" "b" "c"])
  (apply str strs) ;; => (str "a" "b" "c")
  ;; => "abc"
  (apply str 1 strs) ;; => (str 1 "a" "b" "c")
  ;; => "1abc"
  #+end_src

- ~comp~: ~((comp f g) x)~ => ~(f (g x))~

- ~juxt~ (possibly abusing notation): ((juxt a b c) & args) => [(a & args) (b & args) (c & args)]
  #+begin_src clojure
  ((juxt str #(* 2 %)) 1)
  ;; => ["1" 2]
  ((juxt #(println %1 %2) #(* %1 %2)) 1 2)
  1 2
  ;; => [nil 2]
  #+end_src

- ~partial~, e.g.
  #+begin_src clojure
  (defn add [x y] (+ x y))
  (def add-5 (partial add 5))
  (add-5 10)
  ;; => 15
  #+end_src


* Destructuring

