clojure/cheatsheet.md

# Table of Contents

1.  [Tools (CLI)](#orgf7093ff)
2.  [Basics / Miscellanea](#orgcc187cc)
    1.  [Help](#org1a47aec)
3.  [Syntax](#orgc604309)
4.  [Strings](#org3ec76c4)
5.  [Collections](#org75c0501)
    1.  [Sequences](#orgb4d9d5b)
    2.  [Sets](#orgbf0c471)
    3.  [walk, pre-walk, post-walk](#org6bb9f59)
6.  [Transients](#org3998423)
7.  [Functions beget functions](#orgc7793a1)
8.  [Destructuring](#orgbfe10bb)
    1.  [Sequential destructuring](#org5984819)
    2.  [Associative destructuring](#orga11ee37)
        1.  [Keyword arguments](#orged81feb)
        2.  [Namespaced keywords](#org5f99eef)
        3.  [Nested maps](#org0da3cd2)
9.  [Doing](#org9b61a2a)
10. [Branching](#org252ca59)
11. [Reading clojure characters](#org403cc26)
    1.  [Symbols and Vars](#org919fdb9)
    2.  [`^`: Metadata](#orgf51e458)
12. [Built-in macros](#org486ad33)
13. [Namespaces](#org0ad318e)
    1.  [Dependencies](#org82f4e41)
14. [Java interop](#org428fe55)
15. [Abstractions](#org9e48066)
    1.  [Multimethods](#orgdb023f6)
    2.  [Objects](#orgb4375ae)
    3.  [Protocols](#orgf75e299)
    4.  [Polymorphism](#orge434497)
16. [State](#orga908893)
17. [IO](#org7cbdefc)
18. [Vars and global environment](#org28020dd)
19. [Testing](#orgf5abc0d)
    1.  [Kaocha](#orga6cebe4)
20. [Builds and dependencies](#orgd16f2f5)
21. [Performance](#org53c27c4)
22. [Web](#orgb52e294)
    1.  [clj-http](#orgf4cb69f)
23. [Docstrings](#org0b34b61)



<a id="orgf7093ff"></a>

# Tools (CLI)

-   Find dependency versions:

`clj -X:deps find-versions :lib clojure.java-time/clojure.java-time`

-   Write dependency expansion to `trace.edn`: `clj -Strace`
-   Run build function, e.g. `clj -T:build install`
-   Create new library: `clojure -Tclj-new lib :name myname/mylib`


<a id="orgcc187cc"></a>

# Basics / Miscellanea

-   Unused argument: \_, e.g. `(fn [_] do-something)`

-   Anonymous functions:
    
        (fn [msg] (println msg))
        ;; equivalent:
        #(println %)
        ;; positional args: %1, %2, etc.

-   Useful functions:
    
    -   `name`: Returns the name String of a string, symbol or keyword, e.g.
    
        (name :a)
        (name "a")
        (name 'a)
    
    -   `namespace`: Returns the namespace string of a symbol or keyword

-   Using a main
    
    -   With entry function `run`:
    
    `$ clj -X hello/run`
    
    -   Or using entry function `-main`
    -   Launching a script:
        `$ clj -M /path/to/myscript.clj arg1 arg2 arg3`, where
        `*command-line-args*` => `("arg1" "arg2" "arg3")`
    -   [Babashka?](https://book.babashka.org/)

-   `*clojure-version*`

-   `#_` (optionally followed by a space) tells the reader to ignore the next form completely.
    -   Can be stacked to omit multiple forms

,#+begin<sub>src</sub> clojure
[1 2 3 #\_ 4 5]
;; => [1 2 3 5]
{:a 1, #\_#\_ :b 2, :c 3}
;; => {:a 1, :c 3}
\#+end<sub>src</sub>

-   Equality: `=` is a value-based operation, while `identical?` tests whether its arguments are the same object
    -   Gotcha: this seems subject to some subtleties that produce apparent inconsistencies (see below)

    (identical? [1] [1])
    ;; => false
    (= [1] [1])
    ;; => true
    (= #{1} '(1))
    ;; => false
    (= #{1} [1])
    ;; => false
    (= [1] '(1))
    ;; => true

-   Value of last evaluated expression: `*1`. Analogously, `*2` and `*3` (no higher).

-   Shell commands:

    (require '[clojure.java.shell :as sh])
    (sh/sh "ls" "-aul")


<a id="org1a47aec"></a>

## Help

-   Print public vars (including functions) in a namespace: `(dir namespace)`
-   All namespaces: `(all-ns)`
-   All public definitions in all currently-loaded namespaces matching regex or stringable thing: `(apropos str-or-pattern)`
-   View source code for `sym`: `(source sym)`


<a id="orgc604309"></a>

# Syntax

-   `..`
    E.g.: `(.. System (getProperties) (get "os.name"))`
    expands to `(. (. System (getProperties)) (get "os.name"))`


<a id="org3ec76c4"></a>

# Strings

-   `re-quote-replacement`: escape special characters in literal replacement for a pattern match in `replace` or `replace-first`
    
        (require '[clojure.string :as s])
        (def s "May 2018, June 2019")
        (s/replace s #"May|June" "10$") ;; IllegalArgumentException
        (s/replace s #"May|June" (s/re-quote-replacement "10$ in"))


<a id="org75c0501"></a>

# Collections

-   `find`: returns map entry for given key, or `nil` if absent

    (find {:a 1} :a)
    ;; => [:a 1]
    (val (find {:a 1} :a))
    ;; => 1
    (type (find {:a 1} :a))
    ;; => clojure.lang.MapEntry
    (key (find {:a 1} :a))
    ;; => :a

-   `vector` vs. `vec`

    (vector '(1 2 3))
    ;; => [(1 2 3)]
    (vec '(1 2 3))
    ;; => [1 2 3]

-   `replace`: `(replace smap)`, `(replace smap coll)`

Note: 1. Also applies to sequences. 2. similarities with and differences from `map`

    (replace [10 9 8 7 6] [0 2 4])
    ;; [10 8 6]
    (replace {2 :two, 4 :four} [4 2 3 4 5 6 2])
    ;; [:four :two 3 :four 5 6 :two]
    (map {2 :two, 4 :four} [4 2 3 4 5 6 2])
    ;; (:four :two nil :four nil nil :two)
    (replace [] [0])
    ;; [0]
    (map [] [0])
    ;; IndexOutOfBoundsException ...

-   `index`: `(index xrel ks)`

,#+begin<sub>src</sub> clojure
(require &rsquo;[clojure.set :refer [index]])
(def weights #{ {:name &rsquo;betsy :weight 1000}
                {:name &rsquo;jake :weight 756}
                {:name &rsquo;shyq :weight 1000} })
(index weights [:weight])
;; {{:weight 756}  #{{:name jake, :weight 756}},
;; {:weight 1000} #{{:name shyq, :weight 1000}
;;                  {:name betsy, :weight 1000}}}
\#+end<sub>src</sub>

-   ArrayMap a.k.a. array-map, e.g. `(array-map :a 10)`
    -   Maintains key order. Linear lookup performance, &ldquo;only suitable for *very small* maps&rdquo;.
    -   Only maintains order when un-&ldquo;modified&rdquo;. Subsequent assoc-ing &ldquo;eventually&rdquo; causes it to &ldquo;become&rdquo; a hash-map.

-   `into`: `(into)`, `(into to)`, `(into to from)`, `(into to xform from)`

Conjoin all items of `from` into `to`, e.g.

    (into (sorted-map) [{:a 1} {:c 3} {:b 2}])
    ;; => {:a 1, :b 2, :c 3}
    (into [] {1 2, 3 4})
    ;; => [[1 2] [3 4]]
    (into '() [1 2 3])
    ;; => (3 2 1)

-   `reduced`: `(reduced x)` wraps x such that a `reduce` terminates with the value x

-   `subvec`: `(subvec v start)` `(subvec v start end)`

    (subvec [1 2 3 4 5 6 7] 2)
    ;; => [3 4 5 6 7]
    (subvec [1 2 3 4 5 6 7] 2 4)
    ;; => [3 4]

-   `zipmap`: `(zipmap keys vals)`

    (zipmap [:a :b :c :d :e] [1 2 3 4 5])
    ;; {:a 1, :b 2, :c 3, :d 4, :e 5}
    (zipmap [:a :b :c] [1 2])
    ;; {:a 1, :b 2}
    (zipmap [:a :b :c] (repeat nil))
    ;; {:a nil, :b nil, :c nil}


<a id="orgb4d9d5b"></a>

## Sequences

-   `repeat`: `(repeat x)`, `(repeat n x)`. Note: result is lazy.

    (take 5 (repeat "x"))
    ;; => ("x" "x" "x" "x" "x")
    (repeat 5 "x")
    ;; => ("x" "x" "x" "x" "x")

-   `list*`

    (list* 1 2 [3 4])
    ;; => (1 2 3)
    ;; Corner cases:
    (list* nil [1 2])
    ;; => (nil 1 2)
    (list* 1 nil)
    ;; => (1)
    (list* () [1 2])
    ;; => (() 1 2)
    (list* 1 ())
    ;; => (1)

-   `map-indexed`


<a id="orgbf0c471"></a>

## Sets

`select`: `(select pred xset)`


<a id="org6bb9f59"></a>

## TODO walk, pre-walk, post-walk


<a id="org3998423"></a>

# Transients

-   Vectors, hash-maps, and hash-sets supported
-   `(transient ds)`: O(1) creation from persistent data structures
-   Shares structure with persistent source
-   Interim return values must be returned
-   `(persistent! ds)`: O(1) creation of persistent data structure when done building results
    -   Transient must not be used after: all operations will throw exceptions.
-   Same code structure as functional version: `conj!`, `pop!`, `assoc!`, `dissoc!`, `disj!`


<a id="orgc7793a1"></a>

# Functions beget functions

-   `apply`
    
        (def strs ["a" "b" "c"])
        (apply str strs) ;; => (str "a" "b" "c")
        ;; => "abc"
        (apply str 1 strs) ;; => (str 1 "a" "b" "c")
        ;; => "1abc"

-   `comp`: `((comp f g) x)` => `(f (g x))`

-   `juxt` (possibly abusing notation): ((juxt a b c) & args) => [(a & args) (b & args) (c & args)]
    
        ((juxt str #(* 2 %)) 1)
        ;; => ["1" 2]
        ((juxt #(println %1 %2) #(* %1 %2)) 1 2)
        1 2
        ;; => [nil 2]

-   `partial`, e.g.
    
        (defn add [x y] (+ x y))
        (def add-5 (partial add 5))
        (add-5 10)
        ;; => 15
