clojure/cheatsheet.md


<a id="orgbfe10bb"></a>

# Destructuring


<a id="org5984819"></a>

## Sequential destructuring

    (let [[a _ b _] '(1 2 3 4)] (println _))
    ;; => 4
    
    (def numbers [1 2 3 4 5])
    (let [[x & remaining :as all] numbers]
      (apply prn [remaining all]))
    ;; => (2 3 4 5) [1 2 3 4 5]
    
    (def my-line [[5 10] [10 20]])
    (let [[[a b :as group1] [c d :as group2]] my-line]
      (println a b group1)
      (println c d group2))
    ;; => 5 10 [5 10]
    ;; => 10 20 [10 20]


<a id="orga11ee37"></a>

## Associative destructuring

    (def my-map {:a "A" :b "B" :c 3 :d 4})
    (let [{a :a, x :x, :or {x "Not found!"}, :as all} my-map]
      (println "I got" a "from" all)
      (println "Where is x?" x))
    ;= I got A from {:a "A" :b "B" :c 3 :d 4}
    ;= Where is x? Not found!
    
    (def client {:name "Super Co."
                 :location "Philadelphia"
                 :description "The worldwide leader in plastic tableware."})
    (let [{:keys [name location description]} client]
      (println name location "-" description))
    ;= Super Co. Philadelphia - The worldwide leader in plastic tableware.
    
    (def string-keys {"first-name" "Joe" "last-name" "Smith"})
    (let [{:strs [first-name last-name]} string-keys]
      (println first-name last-name))
    ;= Joe Smith
    
    (def symbol-keys {'first-name "Jane" 'last-name "Doe"})
    (let [{:syms [first-name last-name]} symbol-keys]
      (println first-name last-name))
    ;= Jane Doe
    
    (def multiplayer-game-state
      {:joe {:class "Ranger"
             :weapon "Longbow"
             :score 100}} ;...
      )
    (let [{{:keys [class weapon]} :joe} multiplayer-game-state]
      (println "Joe is a" class "wielding a" weapon))
    ; or
    (let [{:joe/keys [class weapon]} multiplayer-game-state]
      (println "Joe is a" class "wielding a" weapon))
    ;= Joe is a Ranger wielding a Longbow


<a id="orged81feb"></a>

### Keyword arguments

    (defn configure [val options]
      (let [{:keys [debug verbose] :or {debug false, verbose false}} options]
        (println "val =" val " debug =" debug " verbose =" verbose)))
    (configure 12 {:debug true})
    ;;val = 12  debug = true  verbose = false
    
    (defn configure [val & {:keys [debug verbose]
                            :or {debug false, verbose false}}]
      (println "val =" val " debug =" debug " verbose =" verbose))
    (configure 10)
    ;;val = 10  debug = false  verbose = false
    (configure 12 :verbose true :debug true)
    ;;val = 12  debug = true  verbose = true
    (configure 12 {:verbose true :debug true})
    ;;val = 12  debug = true  verbose = true
    (configure 12 :debug true {:verbose true})
    ;;val = 12  debug = true  verbose = true


<a id="org5f99eef"></a>

### Namespaced keywords

    (def human {:person/name "Franklin"
                :person/age 25
                :hobby/hobbies "running"})
    (let [{:keys [hobby/hobbies]
           :person/keys [name age]
           :or {age 0}} human]
      (println name "is" age "and likes" hobbies))
    ;= Franklin is 25 and likes running
    
    (let [{:person/keys [age]
           hobby-hobbies :hobby/hobbies
           person-name :person/name} human]
      (println person-name "is" age "and likes" hobby-hobbies))
    ;= Franklin is 25 and likes running
    
    (require '[person :as p])
    (let [person {::p/name "Franklin", ::p/age 25}
          {:keys [::p/name ::p/age]} person]
      (println name "is" age))
    ;= Franklin is 25


<a id="org0da3cd2"></a>

### Nested maps

    (def john-smith {:f-name "John"
                     :l-name "Smith"
                     :phone "555-555-5555"
                     :address {:street "452 Lisp Ln."
                               :city "Macroville"
                               :state "Kentucky"
                               :zip "81321"}
                     :hobbies ["running" "hiking" "basketball"]
                     :company "Functional Industries"})
    (defn print-contact-info
      [{:keys [f-name l-name phone company]
        {:keys [street city state zip]} :address
        [fav-hobby second-hobby] :hobbies}] ...)


<a id="org9b61a2a"></a>

# Doing

-   `doseq`: `(doseq seq-exprs & body)`
    
    -   Repeatedly executes body with bindings and filterings as provided by &ldquo;for&rdquo;. Does not retain head of sequence. Returns nil.
    
        ;; Multiplies every x by every y. Prints -1, -2, -3, 0, ...
        (doseq [x [-1 0 1]
                y [1  2 3]]
          (prn (* x y)))
        ;; Prints 1, 4, 9
        (doseq [[x y] (map list [1 2 3] [1 2 3])]
          (prn (* x y)))
        ;; Prints 3, 8
        (doseq [[[a b] [c d]] (map list (sorted-map :1 1 :2 2) (sorted-map :3 3 :4 4))]
          (prn (* b d)))
        ;; Prints :1 1, :2 2, :3 3
        (doseq [[k v] {:1 1 :2 2 :3 3}]
          (prn k v))
    
    where
    
        (map list [1 2 3] [1 2 3])
        ;; => ((1 1) (2 2) (3 3))
        (map list (sorted-map :1 1 :2 2) (sorted-map :3 3 :4 4))
        ;; => (([:1 1] [:3 3]) ([:2 2] [:4 4]))

-   `dorun`: Force side effects in producing lazy sequences. Does not retain head of sequence; returns nil.
    
        (dorun 5 (repeatedly #(println "hi")))
        ;; prints "hi" 6 times
        (let [x (atom 0)]
          (dorun (take 10 (repeatedly #(swap! x inc))))
          @x)
        ;; => 10
        (dorun (map #(println "hi" %) ["mum" "dad" "sister"]))
        hi mum
        hi dad
        hi sister
        ;; => nil

-   `doall`: Like `dorun` except the sequence head is retained and returned; entire seq kept in memory. E.g.:
    `(doall (map println [1 2 3]))`
    1
    2
    3
    ;; => (nil nil nil)


<a id="org252ca59"></a>

# Branching

-   `when`, `when-not`, `when-let`, `when-first`

-   `cond`: `(cond & clauses)`
    Clauses: a set of test-expr pairs. Returns the expr corresponding to the first logical-true test. E.g.
    
        (defn pos-neg-or-zero
        "Determines whether or not n is positive, negative, or zero"
        [n]
        (cond
          (< n 0) "negative"
          (> n 0) "positive"
          :else "zero"))

-   `condp`: `(condp pred expr & clauses)`
    Each clause takes either form:
    `text-expr result-expr`
    `text-expr :>> result-fn`
    -   For each clause, `(pred test-expr expr)` is evaluated.
        -   Binary clause matches: result-expr is returned.
        -   Ternary clause matches: the result of calling result-fn, a unary function, with the result of the predicate is returned.
    -   E.g.:
        
            (condp some [1 2 3 4]
              #{0 6 7} :>> inc
              #{4 5 9} :>> dec
              #{1 2 3} :>> #(+ % 3)
              42 ; default)
            ;;=> 3

-   `cond->`: `(cond-> expr & clauses)`
    where clauses is a set of test-form pairs. Threads expr through each form corresponding to a test evaluating to true. Does not short-circuit after the first true test.
    
        (cond-> 1          ; we start with 1
          true inc       ; the condition is true so (inc 1) => 2
          false (* 42)   ; the condition is false so the operation is skipped
          (= 2 2) (* 3)) ; (= 2 2) is true so (* 2 3) => 6
        ;;=> 6

-   `case`: `(case e & clauses)`
    where a clause can take either form:
    `test-constant result-expr`
    `(test-constant1 ... test-constantN)  result-expr`
    where e is matched (in constant time, unlike `cond` and `condp`) against each test-constant in the latter. A single default expression can follow the clauses; if none is provided and no clause matches, an IllegalArgumentException is thrown.
    
    -   The test-constants are not evaluated and must be compile-time literals, and need not be quoted.
    -   E.g.
    
        (let [myseq '(1 2)]
        (case myseq
              (()) "empty seq"
              ((1 2)) "my seq"
              "default"))
        ;;=> "my seq"
        (let [myseq '(1 2)]
        (case myseq
              () "empty seq"
              '(1 2) "my seq"
              "default"))
        ;; => "my seq"
        (let [myvec [1 2]]
          (case myvec
                [] "empty vec"
                (vec '(1 2)) "my vec"
                "default"))
        ;;=> "default"


<a id="org403cc26"></a>

# Reading clojure characters
