clojure/cheatsheet.org
** Symbols and Vars

A Symbol (can) references a Var, which holds/represents a value (which may be a function).

- Symbols
#+begin_src clojure
(defn squared [x] (* x x))  ;; evaluates to a Var
;; => #'user/squared
(def n 2)   ; evaluates to a Var
;; => #'user/n
(type 'squared)
;; => clojure.lang.Symbol
(type 'n)
;; => clojure.lang.Symbol
(type 'random-symbol)
;; => clojure.lang.Symbol
'squared
;; => squared
(symbol "squared")  ;; takes string, keyword, or Var argument
;; => squared
#+end_src

- Vars
#+begin_src clojure
(resolve 'squared)
;; => #'user/squared
(var squared)
;; => #'user/squared
#'squared   ;; shorthand
;; => #'user/squared
(type (var squared))
;; => clojure.lang.Var
squared
;; => #function[user/squared]
@(resolve 'squared)
;; => #function[user/squared]
(type @(resolve 'squared))
;; => user$squared
(@(resolve (symbol "squared")) 2)   ;; Deref (with @) the Var named by the Symbol squared
;; => 4
((resolve (symbol "squared")) 2)    ;; A Var asked to act as a function defers to its value
;; => 4
#+end_src

- Symbol can be used as a function: it looks itself up in its argument
  ~('foo {'foo 2})~ is equivalent to ~(get {'foo 2} 'foo)~

- Careful: ~#'sym~, ~(var sym)~, and ~(resolve sym)~ are *not* equivalent!
  #+begin_src clojure
  (defn deref-fn-sym [sym] @#'sym)
  ;; Syntax error compiling var at ... Unable to resolve var: sym in this context
  (defn deref-fn-sym [sym] @(var sym))
  ;; Syntax error compiling var at ... Unable to resolve var: sym in this context
  (defn deref-fn-sym [sym] @(resolve sym))
  ;; => #'user/deref-fn-sym
  #+end_src


** ~^~: Metadata

- A map of values that can be attached to various forms
- Provides extra information; can be used for documentation, compilation warnings, typehints, and other features
#+begin_src clojure
(def ^{:debug true} five 5)
;; or the equivalent shorthand
(def ^:debug five 5)
(meta #'five)
;; => {:ns #<Namespace user>, :name five, :column 1, :debug true, ...}

;; Metadata is attached to the form that follows it
(def m ^:hi [1 2 3])
(meta (var m))
;; => {:line 35, :column 8, ... :name m, :ns #namespace[user]}
(meta m)
;; => {:hi true}

;; Type hint
(def ^Integer five 5)
(meta #'five)
;; => {:ns #<Namespace user>, ... :tag java.lang.Integer}
#+end_src


* Built-in macros

- ~some->~: ~(some-> expr & forms)~
  When ~expr~ is not nil, threads it into the first form (via ->), and when that result is not nil, through the next etc.
  #+begin_src clojure
  (-> {:a 1} :b inc)
  ;; NullPointerException   clojure.lang.Numbers.ops (Numbers.java:942)
  (some-> {:a 1} :b inc)
  ;; nil
  #+end_src

- Return an expression, e.g.
  #+begin_src clojure
  (defmacro ret-export-db [approach-fn conn path]
    `(~approach-fn @~conn ~path))
  (ret-export-db export-db-tc conn "/test/path.txt")
  #+end_src
  Invoking ~ret-export-db~ as above evaluates to ~(export-db-tc @conn "/test/path.txt")~

- ~doto~: ~(doto x & forms)~
  Evaluates ~x~ then calls all the methods and functions invoked in ~forms~ with the value of ~x~ supplied before the given arguments. Returns ~x~. E.g.:
  ~(doto (new java.util.HashMap) (.put "a" 1) (.put "b" 2))~


* Namespaces

- Important namespaces: clojure.core, clojure.repl
- Require functions that can be referred to unqualified:
  ~(ns ns-name (:require [my.namespace :refer [compute other-fn]]))~
- Force loading of all identified libs even if already loaded:
  ~(require '[learn-cljs.import-fns.format :as fmt] :reload)~
- Instruct REPL to operate in namespace:
  ~(in-ns 'learn-cljs.import-fns.format)~
- Current namespace: ~*ns*~
- Remove mapping for symbol from namespace:
  ~(ns-unmap 'user 'base-config)~ or ~(ns-unmap *ns* 'base-config)~
- Unalias namespace: ~(ns-unalias *ns* 'm)~
- Refresh all namespaces:
  #+begin_src clojure
  (require '[clojure.tools.namespace.repl :refer [refresh]])
  (refresh)
  #+end_src

** Dependencies

- require vs. use vs. import:
  - require: load Clojure library
  - use: same as require, and additionally refers to loaded definitions from current ns
  - import: for Java classes and interfaces only, e.g.
  #+begin_src clojure
  (import java.util.Date)
  (def *now* (Date.))
  ;; import multiple classes in a namespace
  (ns wanderung.datascript
    (:require [wanderung.core :as w :refer [create-source]])
    (:import [wanderung.core IConnection IExtract])
  #+end_src

- How to use local dependencies
  - In dependency folder, run $ mvn install
  OR
  - [[https://github.com/technomancy/leiningen/blob/master/doc/TUTORIAL.md#checkout-dependencies][Leiningen checkout dependencies]]
    Update local dependencies without running ~lein install~ and restarting REPL every time a change is made


* Java interop

#+begin_src clojure
(.toUpperCase "fred")
;; => "FRED"
(.getName String)   ; Note: .getName invoked on java.lang.Class
;; => "java.lang.String"
(. java.time.Instant now)
;; => #object[java.time.Instant 0xbc379f "2023-05-12T03:54:22.697416Z"]
(.-x (java.awt.Point. 1 2))
;; => 1
(java.lang.Class/forName "Fully.Qualified.Class.Name")
#+end_src


* Abstractions

** Multimethods
#+begin_src clojure
(defmulti do-math (fn [operation x y] operation))
(defmethod do-math :add [_ x y] (+ x y))
(defmethod do-math :subtract [_ x y] (+ x y))
(do-math :add 1 2)
#+end_src

** Objects
- Where required: ~(require '[clojure.reflect :refer [reflect]])~
- Show methods (and other information) for an object: ~(reflect some-obj)~
  Note that only methods directly defined on the object's class are listed.
- Show methods (including those inherited) on an object's class:
  ~(.getMethods (.getClass (tc/rows some-obj :as-maps)))~

** Protocols

** Polymorphism

- Get supertypes (both classes and interfaces) of a given type, e.g.
  ~(supers clojure.lang.PersistentList$EmptyList)~
  ~(supers clojure.lang.PersistentList)~
- Test whether ~x~ is an instance of class ~c~: ~(instance? c x)~
- More general than ~instance?~: ~(isa? child parent)~ or ~(isa? hierarchy child parent)~
  - Allows relationship established via ~derive~ as well as Java type inheritance
- ~derive~: ~(derive tag parent)~ or ~(derive hierarchy tag parent)~
  where ~parent~ must be a namespace-qualified symbol or keyword; ~child~ can be those or a class.
  E.g.: ~(derive ::milk  ::dairy)~
- More general version of ~supers~: ~parents~, which returns ~derive~ relationships as well
- Analogue of ~parents~: ~descendants~


* State
- Set validator on atom creation, e.g.:
~(atom init-val 0 :validator validator-fn)~
~(atom init-val {:a 1} :validator validator-fn)~


* IO
- Reading and writing line by line:
  #+begin_src clojure
  (with-open [rdr (io/reader (io/file data-dir "agencies.csv"))
              w (io/writer (io/file data-dir "agencies-cp.csv") :append true)]
    (let [rows (line-seq rdr)
          header (->> (string/split (first rows) #",")
                      (map #(str "agency/" %))
                      (string/join ","))]
      (.write w (str header "\n"))
      (doseq [row (rest rows)]
        (.write w (str row "\n")))))
  #+end_src
- Read EDN file: ~(clojure.edn/read (java.io.PushbackReader. (io/reader "test.edn")))~


* Vars and global environment
- Temporarily redefine var (function in this example):
#+begin_src clojure
(alter-var-root #'datahike.api/connect
                (fn [f] (fn [& args] (println "instrumented") (apply f args))))
#+end_src


* Testing
#+begin_src clojure
(require '[clojure.test :refer [run-tests test-vars]])
(require 'foo.bar-test :reload-all)
; for good measure
(dir foo.bar-test)
(meta #'foo.bar-test/test1)
; run all tests
(run-tests 'foo.bar-test)
; run one test
(test-vars [#'foo.bar-test/test2])
#+end_src

