clojure/cheatsheet.org
** Kaocha
~bin/kaocha --focus test.ns~
~bin/kaocha --fail-fast~
~bin/kaocha --no-capture-output~
~bin/kaocha --skip test.ns1 --skip test.ns2~


* Builds and dependencies
- Dependency jars stored under ~/.m2
- Show contents of jar: ~jar tf jar-file~


* Performance
- Benchmarking:
  - Quick benchmark with printed performance summary
    #+begin_src python
    (criterium/with-progress-reporting
     (criterium/quick-bench (nth ^longs (into [] (range 10000)) 0)))
    #+end_src
    - ~quick-benchmark~ or ~benchmark~ to record results
- Profiling: VisualVM sampler tab
- Type hinting:
  - For arrays, e.g.:
    - ~(alength ^longs arr)~ and ~(alength ^"[J" arr)~
    - ~(aget ^"[Ljava.lang.Object;" objs-1 0)~
    where ~arr~ is an array of longs and
    #+begin_src python
    (type (long-array 5))
    ;; => [J
    (type (object-array 5))
    ;; => [Ljava.lang.Object;
    (type ints-1)
    ;; => [I
    (aset ints-2 0 (aget ^"[I" ints-1 0))
    #+end_src
  - In threading macro, just put parenthese around hinted expression:
    #+begin_src clojure
    (fn [^java.nio.file.WatchEvent e]
         (-> e ^java.nio.file.Path (.context) .toAbsolutePath))
    #+end_src


* Web
** clj-http
- debugging: add ~:debug true~ to request map


* Docstrings
- Backtick-quote function arguments and special keywords, e.g.
  "Adds `x` to the transient collection"
- Link to other functions, e.g. "See also \[\[listen!\]\]" (minus escape backslashes)
- Include small examples, e.g. (showing only skeletal code snippet and omitting rest of docstring):
  "```clojure
  (def app ...)
  ```"
- Use tables to describe complex options maps:
  | key          | description    |
  |--------------|----------------|
  | ...          | ...            |
  | `:router`    | Function of ...|
