clojure/cheatsheet.md


<a id="orga6cebe4"></a>

## Kaocha

`bin/kaocha --focus test.ns`
`bin/kaocha --fail-fast`
`bin/kaocha --no-capture-output`
`bin/kaocha --skip test.ns1 --skip test.ns2`


<a id="orgd16f2f5"></a>

# Builds and dependencies

-   Show contents of jar: `jar tf jar-file`


<a id="org53c27c4"></a>

# Performance

-   Benchmarking:
    -   Quick benchmark with printed performance summary
        
            (criterium/with-progress-reporting
             (criterium/quick-bench (nth ^longs (into [] (range 10000)) 0)))
        
        -   `quick-benchmark` or `benchmark` to record results
-   Profiling: VisualVM sampler tab
-   Type hinting:
    -   For arrays, e.g.:
        
        -   `(alength ^longs arr)` and `(alength ^"[J" arr)`
        -   `(aget ^"[Ljava.lang.Object;" objs-1 0)`
        
        where `arr` is an array of longs and
        
            (type (long-array 5))
            ;; => [J
            (type (object-array 5))
            ;; => [Ljava.lang.Object;
            (type ints-1)
            ;; => [I
            (aset ints-2 0 (aget ^"[I" ints-1 0))
    -   In threading macro, just put parenthese around hinted expression:
        
            (fn [^java.nio.file.WatchEvent e]
                 (-> e ^java.nio.file.Path (.context) .toAbsolutePath))


<a id="orgb52e294"></a>

# Web


<a id="orgf4cb69f"></a>

## clj-http

-   debugging: add `:debug true` to request map


<a id="org0b34b61"></a>

# Docstrings

-   Backtick-quote function arguments and special keywords, e.g.
    &ldquo;Adds \`x\` to the transient collection&rdquo;
-   Link to other functions, e.g. &ldquo;See also $$\[listen!$$\\]&rdquo; (minus escape backslashes)
-   Include small examples, e.g. (showing only skeletal code snippet and omitting rest of docstring):
    &ldquo;\`\`\`clojure
    (def app &#x2026;)
    \`\`\`&rdquo;
-   Use tables to describe complex options maps:
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-left" />
    
    <col  class="org-left" />
    </colgroup>
    <thead>
    <tr>
    <th scope="col" class="org-left">key</th>
    <th scope="col" class="org-left">description</th>
    </tr>
    </thead>
    
    <tbody>
    <tr>
    <td class="org-left">&#x2026;</td>
    <td class="org-left">&#x2026;</td>
    </tr>
    
    
    <tr>
    <td class="org-left">`:router`</td>
    <td class="org-left">Function of &#x2026;</td>
    </tr>
    </tbody>
    </table>

